["2", "3", "3g", "4g", "4wd", "4x4", "5", "a", "ababa", "abay", "abijatta", "abl", "about", "absent", "academ", "accept", "access", "accessori", "acclimat", "accommod", "accur", "accuraci", "across", "action", "activ", "activit", "ad", "addi", "addit", "address", "adjust", "admiss", "adorn", "adult", "advanc", "advantag", "adventur", "advic", "advis", "advisori", "aerial", "afar", "affect", "afford", "africa", "african", "after", "afternoon", "age", "agenc", "ago", "agricultur", "ahead", "aid", "air", "airfield", "airport", "ale", "aliv", "all", "alloc", "allow", "alon", "along", "alpin", "altern", "altitud", "alway", "am", "amen", "amhar", "among", "amount", "an", "ancient", "and", "angl", "ani", "anim", "annual", "anoth", "antiqu", "anyon", "anyth", "anytim", "anywher", "apart", "app", "appear", "appli", "applic", "appreci", "approach", "appropri", "approxim", "april", "aquat", "arba", "archaeolog", "architectur", "are", "area", "ark", "around", "arrang", "arriv", "art", "artifact", "artifici", "artisan", "as", "ask", "aspect", "assess", "assist", "associ", "at", "atmospher", "attend", "attent", "attir", "attract", "authent", "author", "avail", "averag", "avoid", "awar", "awasa", "away", "axum", "b", "baboon", "back", "background", "backpack", "bad", "bag", "bahir", "balanc", "bale", "bank", "base", "basi", "basic", "basketri", "bat", "bath", "bathroom", "bazaar", "be", "beach", "beachsid", "bean", "beauti", "becom", "been", "befor", "beforehand", "begin", "beginn", "behav", "behavior", "behind", "belief", "below", "benefit", "besid", "best", "better", "between", "big", "biggest", "bilharzia", "biodivers", "biographi", "biospher", "bird", "birdlif", "birdwatch", "birr", "bite", "blend", "blue", "boat", "bodi", "boil", "book", "boot", "both", "bottl", "bottom", "bridg", "brief", "bring", "brochur", "brows", "brush", "bs", "bu", "budget", "build", "built", "bureau", "buri", "burial", "buse", "busi", "busiest", "buy", "by", "ca", "cafe", "call", "calm", "camera", "camp", "campground", "campsit", "can", "cano", "capit", "captur", "car", "card", "care", "carri", "carv", "case", "casual", "catch", "categori", "cater", "cathedr", "caus", "cautiou", "cave", "cavern", "celebr", "cell", "center", "centuri", "ceremoni", "certain", "certifi", "challeng", "chamber", "chanc", "chang", "characterist", "charg", "cheap", "cheapli", "check", "checklist", "children", "choos", "christian", "church", "circuit", "citi", "clan", "clean", "clearli", "climat", "clinic", "close", "closer", "closest", "closur", "cloth", "code", "coffe", "coincid", "cold", "color", "column", "combin", "come", "comfort", "commerci", "common", "commonli", "commun", "compani", "compar", "complet", "complex", "compon", "compound", "compulsori", "comput", "con", "concern", "concess", "condit", "confirm", "connect", "consciou", "conserv", "consid", "consider", "constant", "construct", "consult", "consumpt", "contact", "contain", "context", "continu", "contribut", "conveni", "cook", "cool", "coordin", "cost", "count", "countri", "cours", "coven", "cover", "coverag", "craft", "craftspeopl", "crater", "creat", "creation", "creatur", "credit", "crime", "criteria", "crocodil", "crop", "cross", "crowd", "crucial", "cruis", "cuisin", "cultur", "cup", "currenc", "current", "custom", "cyber", "cycl", "daili", "dallol", "dam", "damo", "danakil", "danc", "danger", "dar", "dark", "dashen", "data", "date", "day", "daypack", "dead", "deal", "death", "debark", "debr", "deceas", "decemb", "decent", "declar", "dedic", "deep", "defin", "definit", "dehydr", "deiti", "demonstr", "depend", "depress", "describ", "descript", "desert", "design", "destin", "detail", "develop", "devic", "did", "die", "dietari", "differ", "difficult", "difficulti", "digit", "dimens", "dine", "dip", "direct", "directli", "disappear", "discount", "discourag", "discov", "diseas", "dish", "display", "disrespect", "distanc", "distinct", "divers", "divid", "do", "doabl", "doctor", "document", "doe", "domest", "done", "down", "download", "downstream", "dozen", "draw", "dress", "dri", "drink", "drinkabl", "drive", "drone", "drop", "due", "dug", "durat", "dure", "dwell", "each", "eagl", "earth", "easi", "easier", "easiest", "easili", "east", "eastern", "eat", "eaten", "eateri", "ecolog", "economi", "ecosystem", "educ", "effect", "effici", "effigi", "effort", "elder", "electr", "electrolyt", "electron", "element", "elev", "els", "elsewher", "email", "emerg", "emphas", "encount", "end", "endang", "endem", "enforc", "engag", "english", "enhanc", "enjoy", "enough", "ensur", "entail", "enter", "entertain", "enthusiast", "entir", "entoto", "entranc", "entri", "environ", "environment", "equip", "erect", "eros", "erta", "erupt", "essenti", "estim", "etc", "ethio", "ethiopia", "ethiopian", "ethnic", "etiquett", "evacu", "even", "event", "ever", "everyon", "everyth", "everywher", "evid", "evisa", "evolut", "evolv", "exact", "exactli", "exampl", "exchang", "excurs", "exist", "expans", "expect", "expens", "experi", "experienc", "expert", "explain", "explor", "extend", "extens", "extent", "extra", "extraordinari", "extrem", "fabric", "face", "facil", "facilit", "fact", "factor", "fair", "faith", "fall", "fame", "famili", "famou", "far", "fare", "farm", "faster", "fauna", "faux", "favor", "feasibl", "featur", "fee", "feed", "feel", "feet", "femal", "festiv", "fever", "few", "field", "figur", "film", "filter", "find", "first", "fish", "fishermen", "fit", "fix", "flamingo", "flash", "flashlight", "flat", "fli", "flight", "flock", "flood", "floor", "flora", "flow", "fluctuat", "focu", "focus", "folk", "folklor", "follow", "food", "foot", "footag", "footbridg", "footwear", "for", "forecast", "foreign", "forest", "form", "format", "fortifi", "found", "free", "freeli", "freez", "friendli", "from", "full", "fulli", "fun", "funer", "funerari", "gain", "gate", "gateway", "gear", "gelada", "gener", "geograph", "geolog", "geotherm", "gestur", "get", "geyser", "giant", "gift", "give", "given", "glori", "go", "goat", "goe", "gondar", "good", "govern", "gp", "grassi", "great", "greater", "greatli", "green", "greet", "ground", "group", "grow", "grown", "guarante", "guest", "guesthous", "guid", "guidelin", "ha", "habitat", "half", "hamar", "hand", "handcraft", "handicraft", "handl", "handmad", "happen", "harar", "harari", "hard", "harm", "have", "hazard", "head", "headlamp", "headquart", "health", "healthcar", "healthi", "heat", "heatstrok", "heavi", "height", "held", "hello", "help", "heritag", "hey", "hi", "high", "highest", "highland", "highlight", "hike", "hiker", "hippo", "hire", "histor", "histori", "hold", "holi", "holiday", "home", "homeland", "homestay", "horizont", "hospit", "host", "hot", "hotel", "hotspot", "hottest", "hour", "hous", "how", "human", "humid", "hussein", "hut", "hydrat", "hygien", "i", "ibex", "icon", "id", "idea", "ideal", "if", "ill", "immedi", "immers", "immun", "impact", "import", "impress", "in", "inaccess", "includ", "incom", "incorrect", "independ", "indic", "indigen", "individu", "inexpens", "influenc", "inform", "inhabit", "initi", "injera", "injur", "inscript", "insect", "insid", "inspir", "instabl", "instal", "intend", "intens", "interact", "interest", "interior", "intern", "internet", "intervent", "into", "involv", "is", "islam", "island", "issat", "issu", "it", "item", "itinerari", "itself", "jacket", "jerusalem", "jewelri", "jinka", "job", "join", "journey", "jugol", "june", "just", "kayak", "keep", "keepsak", "kept", "key", "kid", "kidan", "kilomet", "kind", "king", "kinship", "kit", "know", "knowledg", "known", "konso", "lake", "lakesid", "lalibela", "lammergei", "land", "landmark", "landscap", "langano", "languag", "laptop", "larg", "largest", "last", "lava", "law", "lead", "leader", "learn", "led", "left", "legal", "legend", "len", "length", "less", "level", "libano", "lie", "life", "lifestyl", "light", "like", "limeston", "lip", "list", "littl", "live", "lobelia", "local", "locat", "lodg", "logist", "long", "longer", "longest", "look", "lose", "lost", "lot", "lover", "low", "lowland", "luggag", "lunch", "luxuri", "made", "main", "mainli", "maintain", "major", "make", "makonnen", "malaria", "mammal", "mandatori", "mani", "manner", "map", "mari", "mark", "marker", "market", "massiv", "materi", "matter", "maximum", "me", "meal", "mean", "measur", "meat", "medic", "meet", "mehret", "mekel", "memento", "merkato", "meskel", "meter", "method", "might", "migratori", "mile", "minch", "mine", "minibus", "minimum", "miss", "mist", "mistak", "mobil", "mode", "modern", "modestli", "molten", "monasteri", "money", "monk", "monkey", "monolith", "month", "monument", "more", "morn", "mosqu", "mosquito", "most", "mount", "mountain", "mourn", "move", "much", "mud", "muddi", "mule", "multipl", "mursi", "museum", "music", "muslim", "my", "myself", "myth", "name", "namesak", "nation", "nativ", "natur", "navig", "near", "nearbi", "nearest", "necess", "necessari", "need", "negoti", "neighbor", "network", "new", "next", "nice", "nicknam", "night", "nightlif", "nighttim", "nile", "no", "nomad", "norm", "normal", "northern", "not", "notabl", "now", "nuisanc", "number", "obelisk", "observ", "obtain", "occur", "of", "offend", "offens", "offer", "offic", "offici", "offlin", "often", "okay", "olahita", "old", "oldest", "omar", "omo", "on", "onc", "one", "onli", "onlin", "open", "oper", "opportun", "optim", "option", "or", "oral", "order", "organ", "origin", "ornament", "oromia", "oromo", "other", "out", "outdoor", "outfit", "outlet", "outsid", "over", "overlook", "overnight", "overview", "own", "pa", "pack", "packag", "paid", "paint", "palac", "panoram", "paperwork", "parasit", "park", "part", "particip", "particularli", "pass", "passag", "past", "path", "pathway", "pattern", "pave", "pay", "payment", "peak", "pelican", "peopl", "per", "percentag", "perfect", "perform", "period", "perman", "permih", "permiss", "permit", "person", "perspect", "pharmaci", "phenomena", "phenomenon", "phone", "photo", "photograph", "photographi", "phrase", "picnic", "pictur", "picturesqu", "pilgrimag", "pill", "pitch", "place", "plan", "plane", "plant", "plate", "play", "plug", "point", "pole", "polici", "polit", "pool", "popul", "popular", "portugues", "pose", "posit", "possibl", "potabl", "potenti", "power", "practic", "prayer", "precaut", "precipit", "predat", "predict", "prefer", "prepar", "presenc", "present", "preserv", "preval", "prevent", "prey", "price", "primari", "primat", "priorit", "privat", "pro", "problem", "procedur", "process", "product", "profession", "program", "proper", "properli", "protect", "protocol", "provid", "provis", "proxim", "public", "publicli", "purchas", "purifi", "purpos", "put", "qualifi", "qualiti", "queen", "quick", "quickest", "ra", "rail", "rain", "rainbow", "rainfal", "raini", "rang", "ranger", "rank", "rare", "rate", "reach", "readi", "readili", "real", "realist", "realli", "reason", "receiv", "recept", "recogn", "recognit", "recommend", "record", "recreat", "redirect", "reduc", "reduct", "refer", "reflect", "regard", "region", "regist", "regul", "regular", "reign", "rel", "relat", "relationship", "relax", "reli", "reliabl", "religi", "religion", "remain", "remark", "rent", "rental", "repel", "replica", "repres", "reptil", "reput", "requir", "rescu", "reserv", "resid", "residenti", "resort", "resourc", "respect", "rest", "restaur", "restrict", "restroom", "result", "return", "rich", "ride", "rift", "right", "risk", "riski", "ritual", "river", "riverb", "road", "robe", "rock", "rocki", "role", "room", "root", "roughli", "rout", "routin", "rude", "ruin", "rule", "run", "rural", "s", "sacr", "safari", "safe", "safeti", "sale", "salt", "same", "sampl", "sandal", "sandi", "sanit", "sanitari", "satellit", "scene", "sceneri", "scenic", "schedul", "scholar", "school", "scorpion", "scout", "sculptur", "season", "seat", "section", "secur", "sedan", "see", "seen", "select", "selfi", "sell", "semera", "separ", "septemb", "serv", "servic", "set", "settlement", "sever", "shalla", "shape", "share", "sheba", "sheikh", "shift", "shoe", "shop", "shore", "short", "shot", "should", "show", "showcas", "shower", "shrine", "sick", "side", "sight", "sightse", "sign", "signal", "signifi", "signific", "sim", "simien", "similar", "singl", "site", "situat", "size", "skip", "sleep", "sleeveless", "slick", "slip", "slipperi", "small", "smaller", "smoke", "snack", "snake", "sneaker", "snow", "so", "social", "societi", "sof", "sold", "solo", "some", "someon", "someth", "sourc", "southern", "souvenir", "speak", "speci", "special", "specif", "spend", "spent", "spice", "spiritu", "spoken", "sport", "spot", "spray", "spread", "spring", "squar", "stalactit", "stalagmit", "stall", "stand", "standard", "stapl", "start", "station", "statu", "stay", "steep", "step", "stew", "still", "stone", "stop", "store", "stori", "storytel", "strategi", "street", "stretch", "strongest", "structur", "student", "stun", "sturdier", "style", "substitut", "such", "suffici", "sufi", "suggest", "suitabl", "summar", "summer", "sunbath", "sunday", "sunni", "sunset", "supplement", "suppli", "support", "sure", "surfac", "surround", "surviv", "suspens", "sustain", "swim", "symbol", "system", "taboo", "take", "tale", "talk", "tall", "tallest", "tana", "tap", "tast", "taxi", "teach", "techniqu", "technolog", "tecton", "teeth", "telecom", "telephoto", "tell", "temper", "temperatur", "templ", "temporarili", "tent", "term", "terrac", "terrain", "textil", "than", "that", "the", "their", "them", "then", "there", "these", "they", "thi", "thing", "through", "throughout", "ti", "ticket", "tie", "tigrayan", "time", "timefram", "timelin", "timkat", "tip", "titl", "to", "today", "toilet", "told", "tomb", "tonight", "too", "tool", "top", "topographi", "total", "touch", "tour", "tourism", "tourist", "town", "tradit", "trail", "train", "transit", "translat", "transport", "travel", "travers", "treasur", "treatment", "tree", "trek", "trekker", "tri", "tribal", "tribe", "tributari", "triniti", "trip", "tripod", "tropic", "troubl", "true", "tti", "turmi", "two", "type", "typic", "uav", "unbear", "under", "underground", "understand", "unesco", "uniqu", "unlik", "unpav", "unsaf", "unstabl", "unusu", "up", "upscal", "ura", "urban", "usag", "use", "usual", "vacat", "vaccin", "valid", "valley", "valu", "vantag", "vari", "variat", "varieti", "variou", "vegan", "veget", "vegetarian", "vehicl", "vendor", "venu", "veri", "version", "vertic", "via", "vicin", "video", "view", "viewpoint", "villag", "visa", "visibl", "visit", "visitor", "visual", "vital", "volcan", "volcano", "volum", "vs", "vultur", "wa", "waga", "walia", "walk", "walkabl", "wall", "warm", "warn", "watch", "water", "waterfal", "waterproof", "waterway", "way", "we", "wear", "weather", "weav", "web", "week", "weekday", "weekend", "weekli", "welcom", "well", "were", "wet", "what", "when", "where", "whi", "which", "while", "who", "whole", "wide", "width", "wifi", "wild", "wildlif", "will", "wit", "with", "within", "without", "wolf", "wolv", "women", "wonder", "wood", "wooden", "work", "world", "worldwid", "worri", "worship", "worth", "would", "write", "wrong", "year", "yearli", "yeha", "yellow", "you", "young", "younger", "your", "zero", "zion", "ziway", "zone"]